# 22. Задайте список из нескольких чисел. Напишите программу, которая найдёт сумму элементов списка, стоящих на нечётной позиции.
# Пример:
# o [2, 3, 5, 9, 3] -> на нечётных позициях элементы 3 и 9, ответ: 12


# numbers = [2, 3, 5, 9, 3, 5]
# sum_numbers = 0
# for i in range(len(numbers)):
#     if i % 2 > 0:
#         sum_numbers += numbers[i]
# print(sum_numbers)
